cf/DataProcessors/ДолгиПоОплате_Управление.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.4">
	<DataProcessor>
		<Properties>
			<Name>ДолгиПоОплате_Управление</Name>
		</Properties>
	</DataProcessor>
</MetaDataObject>

cf/AccumulationRegisters/ДолгиПоОтгрузкам.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.4">
	<AccumulationRegister>
		<Properties>
			<Name>ДолгиПоОтгрузкам</Name>
			<RegisterType>Balance</RegisterType>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Сумма</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Контрагент</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Заказ</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.ЗаказПокупателя</v8:Type>
						<v8:Type>cfg:DocumentRef.ЗаказНаряд</v8:Type>
						<v8:Type>cfg:DocumentRef.ИнтернетЗаказПокупателя</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ДокументОтгрузки</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.РеализацияТоваров</v8:Type>
						<v8:Type>cfg:DocumentRef.РеализацияПереданныхТоваров</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Партнер</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Партнеры</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</AccumulationRegister>
</MetaDataObject>

cf/AccumulationRegisters/ДолгиПоЗаказам.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.4">
	<AccumulationRegister>
		<Properties>
			<Name>ДолгиПоЗаказам</Name>
			<RegisterType>Balance</RegisterType>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Сумма</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>Менеджер</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>Контрагент</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Заказ</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.ЗаказПокупателя</v8:Type>
						<v8:Type>cfg:DocumentRef.ЗаказНаряд</v8:Type>
						<v8:Type>cfg:DocumentRef.ИнтернетЗаказПокупателя</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Партнер</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Партнеры</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</AccumulationRegister>
</MetaDataObject>

cf/DataProcessors/ДолгиПоОплате_Управление/Forms/Форма/Ext/Form/Module.bsl
&НаКлиенте
Перем АнтиЗацикливание;

&НаСервере
Процедура ОбновитьДокументы()
	
	ДокументыПартнеров.Очистить();
	текДокумент = Неопределено;
	текПериод 	= '00010101';
	
	Если ТекПартнер <> Неопределено Тогда
	
		//Запрос = Новый Запрос("
		//|ВЫБРАТЬ
		//|	ЕСТЬNULL(Ссылка.Партнер, Ссылка.Заказ.Партнер) Партнер,
		//|	ЕСТЬNULL(Ссылка.Контрагент, Ссылка.Заказ.Контрагент) Контрагент,
		//|	ЕСТЬNULL(Ссылка.Организация, Ссылка.Заказ.Организация) Организация,
		//|	Проведен,
		//|	ПометкаУдаления,
		//|	Дата,
		//|	Номер,
		//|	Тип,
		//|	Ссылка Документ
		//|ИЗ
		//|	ЖурналДокументов.ДокументыПартнераСКорректировками
		//|
		//|ГДЕ
		//|	ЕСТЬNULL(Ссылка.Партнер, Ссылка.Заказ.Партнер) = &Партнер
		//|
		//|УПОРЯДОЧИТЬ ПО
		//|	Дата
		//|");
		
		
		Запрос = Новый Запрос("выбрать * из (ВЫБРАТЬ
		|		Представление(Контрагент) Контрагент,
		|		Представление(Организация) Организация,
		|		Истина Проведен,
		|		Ложь ПометкаУдаления,
		|		Период Дата,
		|		Представление(Регистратор) прДокумент,
		|		Регистратор Документ
		|	ИЗ
		|		РегистрНакопления.ДолгиПоОтгрузкам  
		|	ГДЕ
		|	    Партнер = &Партнер
		|	    И Период > &ДатаНачала
		|
		|объединить все
		|
		|ВЫБРАТЬ
		|		Представление(Контрагент) Контрагент,
		|		Представление(Организация) Организация,
		|		Истина Проведен,
		|		Ложь ПометкаУдаления,
		|		Период Дата,
		|		Представление(Регистратор) прДокумент,
		|		Регистратор Документ
		|	ИЗ
		|		РегистрНакопления.ДолгиПоЗаказам  
		|	ГДЕ
		|	    Партнер = &Партнер
		|	    И Период > &ДатаНачала
		|	    и ВидДвижения = Значение(ВидДвиженияНакопления.Приход)
		|	 ) как вт
		|	Упорядочить по Дата 
		|	    ");
		
		
		
		Запрос.УстановитьПараметр("Партнер", ТекПартнер);
		Запрос.УстановитьПараметр("ДатаНачала", ДатаНачала);
		
		ТЗ=Запрос.Выполнить().Выгрузить();
		ДокументыПартнеров.Загрузить(ТЗ);
		
	КонецЕсли;
	
КонецПроцедуры
&НаСервере
Процедура ОбновитьДвижения()
	
	ДолгиПоОтгрузкам.Очистить();
	
	Если текДокумент <> Неопределено Тогда
	
		Запрос = Новый Запрос("
		|ВЫБРАТЬ
		|	Период,
		|	Регистратор,
		|	ВидДвижения,
		|	Организация,
		//|	Представление(Организация) Организация,
		|	Партнер,
		//|	Представление(Партнер) Партнер,
		|	Контрагент,
		//|	Представление(Контрагент) Контрагент,
		|	Заказ,
		|	ДокументОтгрузки,
		|	Сумма
		|ИЗ
		|	РегистрНакопления.ДолгиПоОтгрузкам
		|	
		|ГДЕ
		|	Регистратор = &Регистратор
		|");
		
		Запрос.УстановитьПараметр("Регистратор", текДокумент);
		
		ДолгиПоОтгрузкам.Загрузить(Запрос.Выполнить().Выгрузить());
		
	КонецЕсли;
	
КонецПроцедуры
&НаСервере
Процедура ОбновитьОстатки()
	
	ОстаткиПоДолгам.Очистить();
	
	Если ТекПартнер <> Неопределено Тогда
		
		Запрос = Новый Запрос("
		|ВЫБРАТЬ
		|	Организация,
		|	Партнер,
		|	Заказ,
		|	ДокументОтгрузки,
		|	СуммаОстаток Сумма
		|ИЗ
		|	РегистрНакопления.ДолгиПоОтгрузкам.Остатки(" + ?(Не ЗначениеЗаполнено(текПериод),"","&Период") + ", Партнер = &Партнер)
		|");
		
		Запрос.УстановитьПараметр("Партнер", 	ТекПартнер);
		Запрос.УстановитьПараметр("Период", 	текПериод + 1);
		
		ОстаткиПоДолгам.Загрузить(Запрос.Выполнить().Выгрузить());
		
	КонецЕсли;
	
	Отработало = Истина;
	
КонецПроцедуры
 
&НаКлиенте
Процедура ПартнерыПриАктивизацииСтроки(Элемент)
	
	Если АнтиЗацикливание = Истина Тогда
		Возврат;
	КонецЕсли;
	
	АнтиЗацикливание = Истина;
	
	текПартнер = Элементы.Партнеры.ТекущаяСтрока;
	ОбновитьДокументы();
	ОбновитьДвижения();
	ОбновитьОстатки();
	
	АнтиЗацикливание = Ложь;
	
КонецПроцедуры

&НаКлиенте
Процедура ДокументыПартнеровПриАктивизацииСтроки(Элемент)
	
	ТекДанные = Элементы.ДокументыПартнеров.ТекущиеДанные;
	текДокумент = ?(ТекДанные = Неопределено, Неопределено, ТекДанные.Документ);
	текПериод 	= ?(ТекДанные = Неопределено, '00010101', 	ТекДанные.Дата);
	ОбновитьДвижения();
	ОбновитьОстатки();
	
КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если Не Параметры.Партнер.Пустая() Тогда
		
		Элементы.Партнеры.ТекущаяСтрока = Параметры.Партнер;
		
	КонецЕсли;
	
	ДатаНачала = ДобавитьМесяц(ТекущаяДата(),-12);
	
КонецПроцедуры


&НаСервере
Процедура ПровестиНаСервере(ДокСсылка = Неопределено)
	
	Если ДокСсылка = Неопределено Тогда
		ДокСсылка = текДокумент;
	КонецЕсли;
	
	Если ДокСсылка <> Неопределено Тогда
		
		Обработки.ДолгиПоОплате_Управление.ПровестиНаСервере(ДокСсылка);
		
	КонецЕсли;
	
КонецПроцедуры
&НаСервере
Функция ПолучитьСписокПартнеровДляПроведения()
	
	Запрос = Новый Запрос("ВЫБРАТЬ Ссылка ИЗ СПравочник.Партнеры ГДЕ НЕ ПометкаУдаления");
	Возврат Запрос.Выполнить().Выгрузить().ВыгрузитьКолонку("Ссылка");
	
КонецФункции
&НаКлиенте
Процедура Провести(Команда)
	
	ПровестиНаСервере();
	ОбновитьДвижения();
	ОбновитьОстатки();
	
КонецПроцедуры
Функция ПолучитьСписокДокументовДляПроведения(Партнер = Неопределено)
	
	Если Партнер = Неопределено Тогда
		Партнер = текПартнер;
	КонецЕсли;
	
	Запрос = Новый Запрос("
	|ВЫБРАТЬ
	|	Ссылка Документ
	|ИЗ
	|	ЖурналДокументов.ДокументыПартнераСКорректировками
	|
	|ГДЕ
	|	ЕСТЬNULL(Ссылка.Партнер, Ссылка.Заказ.Партнер) = &Партнер И
	|	Проведен
	|");
	
	Запрос.УстановитьПараметр("Партнер", Партнер);
	Возврат Запрос.Выполнить().Выгрузить().ВыгрузитьКолонку("Документ");
	
КонецФункции
&НаКлиенте
Процедура ПровестиВсе(Команда)
	
	ДокументПров 	= ПолучитьСписокДокументовДляПроведения();
	КолВсего		= ДокументПров.Количество();
	Ном				= 0;
	
	Для Каждого ДокПров Из ДокументПров Цикл Ном = Ном + 1;
		
		ОбработкаПрерыванияПользователя();
		Состояние("Проводим документ", ном / КолВсего * 100, ДокПров);
		ПровестиНаСервере(ДокПров);
		
	КонецЦикла;
	
КонецПроцедуры
&НаКлиенте
Процедура МегаПровестиВсе(Команда)
	
	Если Вопрос("Будут проведени все документы по всем партнерам,
				|Продолжить?",РежимДиалогаВопрос.ДаНет) = КодВозвратаДиалога.Да Тогда
				
		ОбщиеФункции.СообщитьТекст("Запуск обработки " + ТекущаяДата());
				
		СписокПартнеров	= ПолучитьСписокПартнеровДляПроведения();
		КолВсего		= СписокПартнеров.Количество();
		Ном				= 0;
	
		Для Каждого Партнер Из СписокПартнеров Цикл Ном = Ном + 1;
			
			ОбработкаПрерыванияПользователя();
			ДокументПров = ПолучитьСписокДокументовДляПроведения(Партнер);
			
			Для Каждого ДокПров Из ДокументПров Цикл
				
				ОбработкаПрерыванияПользователя();
				Состояние("Проводим " + Партнер, ном / КолВсего * 100,  ДокПров);
				ПровестиНаСервере(ДокПров);
				
			КонецЦикла;
		КонецЦикла;
		
		ОбщиеФункции.СообщитьТекст("Завершение обработки " + ТекущаяДата());
				
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура Обновить(Команда)
	
	ОбновитьДокументы();
	ОбновитьДвижения();
	ОбновитьОстатки();
	
КонецПроцедуры


&НаСервере
Функция ИмяДокумента(ДокСсылка)
	
	Возврат ДокСсылка.Метаданные().Имя;
	
КонецФункции
&НаКлиенте
Процедура ДокументыПартнеровВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	
	ТекДанные = Элемент.ТекущиеДанные;
	ОткрытьФорму("Документ." + ИмяДокумента(ТекДанные.Документ) + ".Форма.ФормаДокумента", Новый Структура("Ключ", ТекДанные.Документ), ЭтаФорма);
	
КонецПроцедуры

&НаСервере
Функция ОрганизацияТекДокумента()
	
	Возврат текДокумент.Организация;
	
КонецФункции
&НаКлиенте
Процедура Управление(Команда)
	
	ОткрытьФорму("Обработка.ДолгиПоОплате_Управление.Форма.Управление", Новый Структура("Организация, Партнер", ОрганизацияТекДокумента(), текПартнер), ЭтаФорма);
	
КонецПроцедуры
